#### EditorInteraction Members

---

|  |
| --- |
| EditorInteraction Class   Constructors   Methods   Properties   See Also |

The  EditorInteraction  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | EditorInteraction | Construct a default interaction. |
| Public method | EditorInteraction(EditorInteractionType) | Construct the interaction with the specified type. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | InteractionType | The type of interaction. |

# See Also

EditorInteraction Class

Autodesk.Revit.UI Namespace